IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT-6-TABLES.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 SONGS.
        05 SONG-NAME      PIC A(20) OCCURS 5 TIMES.
    01 I    PIC 9 VALUE 1.

PROCEDURE DIVISION.
    DISPLAY "INPUT YOUR 5 FAVORITE SONGS"
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        DISPLAY 'ENTER SONG ' I ":" ACCEPT SONG-NAME(I)
    END-PERFORM.
    
    DISPLAY "HERE ARE YOU 5 FAVORITE SONGS"   
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        DISPLAY "SONG " I ": " FUNCTION TRIM(SONG-NAME(I))
    END-PERFORM.
    STOP RUN.