IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT-4-IF-STATEMENTS.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 AGE      PIC 99.

PROCEDURE DIVISION.
    DISPLAY 'WHAT IS YOUR AGE?' ACCEPT AGE.
    
    IF AGE > 15 AND AGE < 18
        DISPLAY "YOU'RE ALMOST THERE!"      
    ELSE 
        IF AGE < 18 
            DISPLAY "YOU'RE A MINOR."
        ELSE 
            DISPLAY "YOU'RE AN ADULT."
        END-IF
    END-IF.
    STOP RUN.