IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT-3-USER-INPUT.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 DESSERT  PIC A(15).
    01 RATING   PIC A(2).

PROCEDURE DIVISION.
    DISPLAY 'WHAT IS YOUR FAVORITE DESSERT?' ACCEPT DESSERT.
    DISPLAY 'WHAT DO YOU RATE IT ON A SCALE OF 1 - 10?' ACCEPT RATING.
    DISPLAY 'YOU RATED ' FUNCTION TRIM(DESSERT) ' A ' FUNCTION TRIM(RATING) ' OUT OF 10.'
    STOP RUN.