IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT-2-VARIABLES.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 FOOD     PIC A(15)   VALUE "Chocolate".
    01 RATING   PIC A(2)    VALUE '9'.
    01 PRICE    PIC 9V99    VALUE 3.99.

PROCEDURE DIVISION.
    DISPLAY 'My favorite food is ' FUNCTION TRIM(FOOD) ' and it costs ' PRICE '. I rate it a ' FUNCTION TRIM(RATING) '.'.
    STOP RUN.