IDENTIFICATION DIVISION.
PROGRAM-ID. ASSIGNMENT-5-PERFORM-UNTIL.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 MOVIE      PIC A(20).
    01 COUNTER    PIC 9 VALUE 1.

PROCEDURE DIVISION.
    PERFORM UNTIL COUNTER > 3
        DISPLAY 'WHAT IS YOUR FAV MOVIE?' ACCEPT MOVIE
        DISPLAY FUNCTION TRIM(MOVIE)
        ADD 1 TO COUNTER
    END-PERFORM.
    STOP RUN.